cases/advection/3Dtranslation/translation/lent-hex-translation/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     lentReconstruct;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         4;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep yes;

maxAlphaCo 0.5;

maxDeltaT       1;

libs ("libtwoPhaseValidation.so"); 

functions
{
    advectInterface 
    {
        type harmonic;
        baseType translation;
        /*type translation;*/

        V (1 1 1); 
        period 0.5;
        phaseShift -0.25; 

        cellVelocityName U; 
        volFluxName phi; 
    }

}


// ************************************************************************* //
